[Demo_Ekoro_ep6_2_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-3072,Y=-53,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=270,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',Vec=(X=-3000,Y=-1550,Z=1290),VecSub=(X=135,Y=0,Z=0),CId=72)
DemoScripts[4]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=-3072,Y=-243,Z=-1000),VecSub=(X=90,Y=0,Z=0),CId=71)
DemoScripts[5]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[6]=(Actor=CHARACTER,Command=POP,Name="怪物(飛行)",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',Vec=(X=-3320,Y=-1550,Z=1310),VecSub=(X=80,Y=0,Z=0),CId=257)
DemoScripts[7]=(Actor=CHARACTER,Command=ACTION,Name="怪物(飛行)",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="mb_DM_0100_lp_Wait",Number=9,CId=257,Bit=4)
DemoScripts[8]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[0]="kr_CE_0000_lp_open_normal",motionName[1]="kr_CM_0003_fx_close_smile_L",motionName[2]="kr_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[9]=(Actor=CHARACTER,Command=PARAM,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',Number=4,Vec=(X=-3040,Y=-1550,Z=1320))
DemoScripts[10]=(Actor=CHARACTER,Command=PARAM,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',Number=11,Vec=(X=-3140,Y=-1208,Z=1320))
DemoScripts[11]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[12]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Trick.GG2_BGM_DM_CMN_Trick_Cue')
DemoScripts[13]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Schoolzone.GG2_AMB_Schoolzone_LP_Cue')
DemoScripts[14]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[15]=(Actor=FADE,Command=WAIT)
DemoScripts[16]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=270,Y=40,Z=0),SecTime=0.5)
DemoScripts[17]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[18]=(Actor=WINDOW,Command=SET)
DemoScripts[19]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[20]=(Actor=WINDOW,Command=EXIT)
DemoScripts[21]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=270,Y=45,Z=0),SecTime=1)
DemoScripts[22]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=-3040,Y=-1355,Z=1208),SecTime=1)
DemoScripts[23]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[24]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-3040,Y=-1355,Z=1208),SecTime=)
DemoScripts[25]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[2]="kr_DM_0102_fx_Stand2Proud",Rate=1,Number=2,Bit=0)
DemoScripts[26]=(Actor=WINDOW,Command=SET)
DemoScripts[27]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep6_2.GG2_V_Ekoro_ep6_2_002_Cue',Name="クロナ")
DemoScripts[28]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[29]=(Actor=CHARACTER,Command=SET,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',SetType=POS,Vec=(X=-3072,Y=-243,Z=0),CId=71)
DemoScripts[30]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[32]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[33]=(Actor=WINDOW,Command=EXIT)
DemoScripts[34]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=-3072,Y=-53,Z=135),SecTime=0.5)
DemoScripts[35]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[36]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-3072,Y=-53,Z=135),SecTime=)
DemoScripts[37]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=270,Y=-5,Z=0),SecTime=0.5)
DemoScripts[38]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[39]=(Actor=WINDOW,Command=SET)
DemoScripts[40]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[41]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[42]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0113_fx_Stand2Depressed",Rate=1,Number=2,Bit=0)
DemoScripts[43]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1300_lp_Depressed",Number=8)
DemoScripts[44]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep6_2.GG2_V_Ekoro_ep6_2_005_Cue',Name="エコロ")
DemoScripts[45]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[46]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[47]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[48]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[49]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1301_fx_Depressed2Stand",Rate=1,Number=2,Bit=0)
DemoScripts[50]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[51]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep6_2.GG2_V_Ekoro_ep6_2_007_Cue',Name="エコロ")
DemoScripts[52]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[53]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[54]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[55]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0003_fx_close_smile_L",Rate=1,Number=1,Bit=0)
DemoScripts[56]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep6_2.GG2_V_Ekoro_ep6_2_009_Cue',Name="エコロ")
DemoScripts[57]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[58]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[59]=(Actor=WINDOW,Command=EXIT)
DemoScripts[60]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[61]=(Actor=AMBIENT,Command=STOP,SecTime=1,SoundID=)
DemoScripts[62]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[63]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[64]=(Actor=SYSTEM,Command=END)

[Select_Ekoro_ep6_2_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Ekoro_ep6_2_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="那......那是什麼!?")

Texts[1]=(Label="TEXT02",Name="庫蘿娜",Text="很好--上吧DEATH!/n要把惡作劇做到極限DEATH囉--!")

Texts[2]=(Label="TEXT03",Name="峯大",Text="那是......庫蘿娜!?")

Texts[3]=(Label="TEXT04",Name="峯大",Text="連那種東西/n都是庫蘿娜的惡作劇嗎?")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="嗚嗚......我開始覺得和那個惡魔/n合作的自己很丟臉了......")

Texts[5]=(Label="TEXT06",Name="峯大",Text="艾可蘿......")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="沒辦法再忍耐下去了!/n既然如此,/n就由我來阻止她!!")

Texts[7]=(Label="TEXT08",Name="峯大",Text="等等,艾可蘿!/n我也要去!")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="好的!/n一起過去吧!")

Texts[9]=(Label="",Name="",Text="")

Texts[10]=(Label="SELECT01",Name="",Text="")

Texts[11]=(Label="SELECT02",Name="",Text="")

Texts[12]=(Label="SELECT03",Name="",Text="")

Texts[13]=(Label="SELECT04",Name="",Text="")

Texts[14]=(Label="SELECT05",Name="",Text="")

Texts[15]=(Label="SELECT06",Name="",Text="")

Texts[16]=(Label="SELECT07",Name="",Text="")

Texts[17]=(Label="SELECT08",Name="",Text="")

Texts[18]=(Label="SELECT09",Name="",Text="")

Texts[19]=(Label="SELECT10",Name="",Text="")


